; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-3-3-3-6-6-3) (:domain depots)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 truck2 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 - Pallet
	crate0 crate1 crate2 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear crate1)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear crate2)
	(at truck0 distributor0)
	(at truck1 depot1)
	(at truck2 depot2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at crate0 distributor2)
	(on crate0 pallet5)
	(at crate1 depot2)
	(on crate1 pallet2)
	(at crate2 distributor2)
	(on crate2 crate0)
)

(:goal (and
		(on crate0 pallet0)
		(on crate1 pallet4)
		(on crate2 pallet3)
	)
))

; plan
1. (lift hoist5 crate2 crate0 distributor2)
   deleted: (at crate2 distributor2) (available hoist5) (on crate2 crate0) (clear crate2)
   added: (lifting hoist5 crate2) (clear crate0)
   goals met: 0 of 3
2. (drive truck0 distributor0 distributor2)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor2)
   goals met: 0 of 3
3. (load hoist5 crate2 truck0 distributor2)
   deleted: (lifting hoist5 crate2)
   added: (in crate2 truck0) (available hoist5)
   goals met: 0 of 3
4. (lift hoist5 crate0 pallet5 distributor2)
   deleted: (at crate0 distributor2) (available hoist5) (on crate0 pallet5) (clear crate0)
   added: (lifting hoist5 crate0) (clear pallet5)
   goals met: 0 of 3
5. (load hoist5 crate0 truck0 distributor2)
   deleted: (lifting hoist5 crate0)
   added: (in crate0 truck0) (available hoist5)
   goals met: 0 of 3
6. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   goals met: 0 of 3
7. (unload hoist0 crate0 truck0 depot0)
   deleted: (available hoist0) (in crate0 truck0)
   added: (lifting hoist0 crate0)
   goals met: 0 of 3
8. (lift hoist2 crate1 pallet2 depot2)
   deleted: (at crate1 depot2) (available hoist2) (on crate1 pallet2) (clear crate1)
   added: (lifting hoist2 crate1) (clear pallet2)
   goals met: 0 of 3
9. (load hoist2 crate1 truck2 depot2)
   deleted: (lifting hoist2 crate1)
   added: (in crate1 truck2) (available hoist2)
   goals met: 0 of 3
10. (drive truck2 depot2 distributor1)
   deleted: (at truck2 depot2)
   added: (at truck2 distributor1)
   goals met: 0 of 3
11. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 0 of 3
12. (drop hoist0 crate0 pallet0 depot0)
   deleted: (lifting hoist0 crate0) (clear pallet0)
   added: (at crate0 depot0) (available hoist0) (on crate0 pallet0) (clear crate0)
   goals met: 1 of 3
13. (unload hoist3 crate2 truck0 distributor0)
   deleted: (available hoist3) (in crate2 truck0)
   added: (lifting hoist3 crate2)
   goals met: 1 of 3
14. (drop hoist3 crate2 pallet3 distributor0)
   deleted: (lifting hoist3 crate2) (clear pallet3)
   added: (at crate2 distributor0) (available hoist3) (on crate2 pallet3) (clear crate2)
   goals met: 2 of 3
15. (unload hoist4 crate1 truck2 distributor1)
   deleted: (available hoist4) (in crate1 truck2)
   added: (lifting hoist4 crate1)
   goals met: 2 of 3
16. (drop hoist4 crate1 pallet4 distributor1)
   deleted: (lifting hoist4 crate1) (clear pallet4)
   added: (at crate1 distributor1) (available hoist4) (on crate1 pallet4) (clear crate1)
   goals met: 3 of 3
